In [1]:
import pandas as pd

In [5]:
data=pd.read_csv('data/data_dirty.csv')
data

   age   sex incomem
0   12   NaN    1200
1   40  Male      na
2   25  Male   29000
3    3   NaN   25000
4  AGE     -    3600
5   31  Male   25000
6   31  'NaN     NaN

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   age      7 non-null      object
 1   sex      5 non-null      object
 2   incomem  6 non-null      object
dtypes: object(3)
memory usage: 296.0+ bytes

In [7]:
data=pd.read_csv('data/data_dirty.csv',header=0 ,names=['age','sex','income']
                 ,na_values=["Na","NaN","-","na"])

In [8]:
data

   age   sex   income
0   12   NaN   1200.0
1   40  Male      NaN
2   25  Male  29000.0
3    3   NaN  25000.0
4  AGE   NaN   3600.0
5   31  Male  25000.0
6   31  'NaN      NaN

In [17]:
#
data.loc[:,['age','sex']]

   age   sex
0   12   NaN
1   40  Male
2   25  Male
3    3   NaN
4  AGE   NaN
5   31  Male
6   31  'NaN

In [18]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   age     7 non-null      object
 1   sex     4 non-null      object
 2   income  5 non-null      float64
dtypes: float64(1), object(2)
memory usage: 296.0+ bytes

In [21]:
pd.to_numeric(data['age'],errors='coerce')

0    12.0
1    40.0
2    25.0
3     3.0
4     NaN
5    31.0
6    31.0
Name: age, dtype: float64

In [22]:
data['age']=pd.to_numeric(data['age'],errors='coerce')

In [23]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   age     6 non-null      float64
 1   sex     4 non-null      object
 2   income  5 non-null      float64
dtypes: float64(2), object(1)
memory usage: 296.0+ bytes

In [24]:
data

    age   sex   income
0  12.0   NaN   1200.0
1  40.0  Male      NaN
2  25.0  Male  29000.0
3   3.0   NaN  25000.0
4   NaN   NaN   3600.0
5  31.0  Male  25000.0
6  31.0  'NaN      NaN